---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.ProblemRegeneratingInGroupUpdate
source: html/a047958f-8333-09ba-b8fe-898f14cbd21a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.ProblemRegeneratingInGroupUpdate Property

Unable to regenerate while updating groups at end of transaction.

## Syntax (C#)
```csharp
public static FailureDefinitionId ProblemRegeneratingInGroupUpdate { get; }
```